Masmiseim36/nxpSDK/boards/twrkl28z72m/project_template/pin_mux.c
/*
 * Copyright 2018 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v4.1
processor: MKL28Z512xxx7
package_id: MKL28Z512VLL7
mcu_data: ksdk2_0
processor_version: 4.0.0
board: TWR-KL28Z72M
pin_labels:
- {pin_num: '34', pin_signal: TSI0_CH1/PTA0/LPUART0_CTS_b/TPM0_CH5/LPI2C0_SDAS/SWD_CLK, label: 'J30[4]/J32[1]/U20[3]/SWD_CLK_TGTMCU'}
- {pin_num: '35', pin_signal: TSI0_CH2/PTA1/LPUART0_RX/TPM2_CH0, label: 'U11[3]/UART0_RX', identifier: DEBUG_UART_RX}
- {pin_num: '36', pin_signal: TSI0_CH3/PTA2/LPUART0_TX/TPM2_CH1, label: 'U12[4]/UART0_TX', identifier: DEBUG_UART_TX}
- {pin_num: '37', pin_signal: TSI0_CH4/PTA3/LPI2C1_SCL/TPM0_CH0/LPUART0_RTS_b/SWD_DIO, label: 'J30[2]/J33[1]/U9[3]/SWD_DIO_TGTMCU'}
- {pin_num: '38', pin_signal: TSI0_CH5/PTA4/LLWU_P3/LPI2C1_SDA/TPM0_CH1/NMI0_b, label: 'J24[3]/NMI0/TSI0_CH5/SW3', identifier: SW3}
- {pin_num: '39', pin_signal: PTA5/USB_CLKIN/TPM0_CH2/LPI2C2_HREQ/I2S0_TX_BCLK, label: 'J31[A22]/I2S0_TX_BCLK'}
- {pin_num: '40', pin_signal: PTA6/TPM0_CH3, label: 'J31[A62]'}
- {pin_num: '41', pin_signal: PTA7/LPSPI0_PCS3/TPM0_CH4/LPI2C2_SDAS, label: 'J31[A63]'}
- {pin_num: '42', pin_signal: PTA12/TPM1_CH0/LPI2C2_SCL/I2S0_TXD0, label: 'J31[A25]/I2S0_TXD0'}
- {pin_num: '43', pin_signal: PTA13/LLWU_P4/TPM1_CH1/LPI2C2_SDA/I2S0_TX_FS, label: 'J31[A23]/I2S0_TX_FS'}
- {pin_num: '44', pin_signal: PTA14/LPSPI0_PCS0/LPUART0_TX/LPI2C2_SCL/I2S0_RX_BCLK/I2S0_TXD0, label: 'J20[2]/LED_GREEN', identifier: LED_GREEN}
- {pin_num: '45', pin_signal: PTA15/LPSPI0_SCK/LPUART0_RX/I2S0_RXD0, label: 'J31[A24]/I2S0_RXD0'}
- {pin_num: '46', pin_signal: PTA16/LPSPI0_SOUT/LPUART0_CTS_b/I2S0_RX_FS/I2S0_RXD0, label: 'J22[2]/LED_RED', identifier: LED_RED}
- {pin_num: '47', pin_signal: ADC0_SE22/PTA17/LPSPI0_SIN/LPUART0_RTS_b/I2S0_MCLK, label: 'J31[A21]/I2S0_MCLK'}
- {pin_num: '50', pin_signal: EXTAL0/PTA18/LPUART1_RX/TPM0_CLKIN, label: 'J5[2]/J8[2]/Y1[3]/Y4[1]/EXTAL0', identifier: EXTAL0}
- {pin_num: '51', pin_signal: XTAL0/PTA19/LPUART1_TX/TPM1_CLKIN/LPTMR0_ALT1/LPTMR1_ALT1, label: 'J7[2]/J36[1]/Y1[1]/Y4[2]/XTAL0', identifier: XTAL0}
- {pin_num: '52', pin_signal: PTA20/LPI2C0_SCLS/TPM2_CLKIN/RESET_b, label: 'J9[3]/J23[20]/J24[20]/J30[10]/U3[3]/RST_TGTMCU_B'}
- {pin_num: '8', pin_signal: VDD8, label: 'J34[2]/MCU_PWR'}
- {pin_num: '30', pin_signal: VDD31, label: 'J34[2]/MCU_PWR'}
- {pin_num: '48', pin_signal: VDD53, label: 'J34[2]/MCU_PWR'}
- {pin_num: '75', pin_signal: VDD82, label: 'J34[2]/MCU_PWR'}
- {pin_num: '89', pin_signal: VDD98, label: 'J34[2]/MCU_PWR'}
- {pin_num: '22', pin_signal: VDDA, label: 'J4[1]/J34[2]/MCU_PWR'}
- {pin_num: '9', pin_signal: VSS9, label: GND}
- {pin_num: '25', pin_signal: VSSA, label: GND}
- {pin_num: '29', pin_signal: VSS30, label: GND}
- {pin_num: '49', pin_signal: VSS54, label: GND}
- {pin_num: '74', pin_signal: VSS81, label: GND}
- {pin_num: '88', pin_signal: VSS97, label: GND}
- {pin_num: '13', pin_signal: VREGIN, label: 'J1[2]/VREGIN_KL28', identifier: VREGIN}
- {pin_num: '53', pin_signal: ADC0_SE8/TSI0_CH0/PTB0/LLWU_P5/LPI2C0_SCL/TPM1_CH0/FXIO0_D8, label: 'J24[5]/J26[9]/J31[A72]/TSI0_CH0/FXIO0_D8'}
- {pin_num: '54', pin_signal: ADC0_SE9/TSI0_CH6/PTB1/LPI2C0_SDA/TPM1_CH1/FXIO0_D9, label: 'J24[7]/J26[10]/J31[A71]/TSI0_CH6/FXIO0_D9'}
- {pin_num: '55', pin_signal: ADC0_SE12/TSI0_CH7/PTB2/LPI2C0_SCL/TPM2_CH0/LPUART0_RTS_b/FXIO0_D10, label: 'J24[8]/J26[11]/J31[A70]/TSI0_CH7/FXIO0_D10'}
- {pin_num: '56', pin_signal: ADC0_SE13/TSI0_CH8/PTB3/LPI2C0_SDA/TPM2_CH1/LPSPI1_PCS3/LPUART0_CTS_b/FXIO0_D11, label: 'J24[9]/J26[12]/J31[A69]/TSI0_CH8/FXIO0_D11'}
- {pin_num: '57', pin_signal: PTB7/LPSPI1_PCS1, label: 'J31[B35]'}
- {pin_num: '58', pin_signal: PTB8/LPSPI1_PCS0/FXIO0_D12, label: 'J26[13]/J31[A68]/FXIO0_D12'}
- {pin_num: '59', pin_signal: PTB9/LPSPI1_SCK/FXIO0_D13, label: 'J26[14]/J31[A67]/FXIO0_D13'}
- {pin_num: '60', pin_signal: PTB10/LPSPI1_PCS0/FXIO0_D14, label: 'J26[15]/J31[A66]/FXIO0_D14'}
- {pin_num: '61', pin_signal: PTB11/LPSPI1_SCK/TPM2_CLKIN/FXIO0_D15, label: 'J26[16]/J31[B66]/FXIO0_D15'}
- {pin_num: '62', pin_signal: TSI0_CH9/PTB16/LPSPI1_SOUT/LPUART0_RX/TPM0_CLKIN/LPSPI2_PCS3/FXIO0_D16, label: 'J24[10]/J26[17]/J31[B67]/TSI0_CH9/FXIO0_D16'}
- {pin_num: '63', pin_signal: TSI0_CH10/PTB17/LPSPI1_SIN/LPUART0_TX/TPM1_CLKIN/LPSPI2_PCS2/FXIO0_D17, label: 'J24[11]/J26[18]/J31[B64]/TSI0_CH10/FXIO_D17'}
- {pin_num: '64', pin_signal: TSI0_CH11/PTB18/TPM2_CH0/I2S0_TX_BCLK/LPI2C1_HREQ/FXIO0_D18, label: 'J24[12]/J26[19]/J31[B71]/TSI0_CH11/FXIO0_D18'}
- {pin_num: '65', pin_signal: TSI0_CH12/PTB19/TPM2_CH1/I2S0_TX_FS/LPSPI2_PCS1/FXIO0_D19, label: 'J24[13]/J26[20]/J27[2]/J31[B72]/TSI0_CH12/FXIO0_D19/microUSB_FLGA',
  identifier: USB_FLGA}
- {pin_num: '66', pin_signal: PTB20/LPSPI2_PCS0/CMP0_OUT, label: 'J25[11]/J31[B9]/SPI2_PCS0'}
- {pin_num: '67', pin_signal: PTB21/LPSPI2_SCK/CMP1_OUT, label: 'J25[12]/J31[B7]/SPI2_SCK'}
- {pin_num: '68', pin_signal: PTB22/LPSPI2_SOUT, label: 'J25[10]/J31[B10]/SPI2_SOUT'}
- {pin_num: '69', pin_signal: PTB23/LPSPI2_SIN, label: 'J25[9]/J31[B11]/SPI2_SIN'}
- {pin_num: '70', pin_signal: ADC0_SE14/TSI0_CH13/PTC0/LPSPI2_PCS1/USB_SOF_OUT/CMP0_OUT/I2S0_TXD0, label: 'J24[14]/TSI0_CH13/ELEC2', identifier: TSI_ELECTRODE_2}
- {pin_num: '71', pin_signal: ADC0_SE15/TSI0_CH14/PTC1/LLWU_P6/LPI2C1_SCL/LPUART1_RTS_b/TPM0_CH0/I2S0_TXD0, label: 'J24[15]/TSI0_CH14'}
- {pin_num: '72', pin_signal: ADC0_SE11/CMP1_IN0/TSI0_CH15/PTC2/LPI2C1_SDA/LPUART1_CTS_b/TPM0_CH1/I2S0_TX_FS, label: 'J24[16]/TSI0_CH15/ELEC1', identifier: TSI_ELECTRODE_1}
- {pin_num: '73', pin_signal: CMP1_IN1/PTC3/LLWU_P7/LPSPI0_PCS1/LPUART1_RX/TPM0_CH2/CLKOUT/I2S0_TX_BCLK, label: CLKOUT}
- {pin_num: '76', pin_signal: PTC4/LLWU_P8/LPSPI0_PCS0/LPUART1_TX/TPM0_CH3/I2S0_MCLK/CMP1_OUT, label: 'J31[B61]'}
- {pin_num: '77', pin_signal: PTC5/LLWU_P9/LPSPI0_SCK/LPTMR0_ALT2/LPTMR1_ALT2/I2S0_RXD0/CMP0_OUT, label: 'J16[1]/J31[B59]/U15[11]/INT1', identifier: ACCEL_I2C_INT1}
- {pin_num: '78', pin_signal: CMP0_IN0/PTC6/LLWU_P10/LPSPI0_SOUT/I2S0_RX_BCLK/I2S0_MCLK, label: 'J17[1]/J31[B57]/U15[9]/INT2', identifier: ACCEL_I2C_INT2}
- {pin_num: '79', pin_signal: CMP0_IN1/PTC7/LPSPI0_SIN/USB_SOF_OUT/I2S0_RX_FS/FXIO0_D20, label: 'J26[21]/J28[2]/J31[B63]/FXIO0_D20/microUSB_ENA', identifier: USB_ENA}
- {pin_num: '80', pin_signal: CMP0_IN2/PTC8/LPI2C0_SCL/TPM0_CH4/I2S0_MCLK/FXIO0_D21, label: 'J25[3]/J26[22]/J31[A7]/I2C0_SCL/FXIO0_D21'}
- {pin_num: '81', pin_signal: CMP0_IN3/PTC9/LPI2C0_SDA/TPM0_CH5/I2S0_RX_BCLK/FXIO0_D22, label: 'J25[4]/J26[23]/J31[A8]/I2C0_SDA/FXIO0_D22'}
- {pin_num: '82', pin_signal: PTC10/LPI2C1_SCL/I2S0_RX_FS/FXIO0_D23, label: 'J14[1]/J26[24]/U15[4]/I2C1_SCL/FXIO0_D23', identifier: ACCEL_I2C_SCL}
- {pin_num: '83', pin_signal: PTC11/LLWU_P11/LPI2C1_SDA/I2S0_RXD0, label: 'J15[1]/U15[6]/I2C1_SDA', identifier: ACCEL_I2C_SDA}
- {pin_num: '84', pin_signal: PTC12/LPI2C1_SCLS/TPM0_CLKIN, label: 'J25[15]/J31[A10]'}
- {pin_num: '85', pin_signal: PTC13/LPI2C1_SDAS/TPM1_CLKIN, label: 'J25[16]/J31[A11]'}
- {pin_num: '86', pin_signal: PTC14/EMVSIM0_CLK, label: 'J26[27]/J31[B22]/EVMSIM0_CLK'}
- {pin_num: '87', pin_signal: PTC15/EMVSIM0_RST, label: 'J26[28]/J31[B52]/EVMSIM0_RST'}
- {pin_num: '90', pin_signal: PTC16/EMVSIM0_VCCEN, label: 'J26[29]/J31[B55]/EVMSIM0_VCCEN'}
- {pin_num: '91', pin_signal: PTC17/EMVSIM0_IO/LPSPI0_PCS3, label: 'J18[2]/J26[30]/EVMSIM0_IO/LED_ORANGE', identifier: LED_ORANGE}
- {pin_num: '92', pin_signal: PTC18/EMVSIM0_PD/LPSPI0_PCS2, label: 'J19[2]/J26[31]/EVMSIM0_PD/LED_YELLOW', identifier: LED_YELLOW}
- {pin_num: '93', pin_signal: PTD0/LLWU_P12/LPSPI0_PCS0/LPUART2_RTS_b/TPM0_CH0/FXIO0_D0, label: 'J26[1]/J31[A80]/FXIO0_D0'}
- {pin_num: '94', pin_signal: ADC0_SE5b/PTD1/LPSPI0_SCK/LPUART2_CTS_b/TPM0_CH1/FXIO0_D1, label: 'J26[2]/J31[A79]/FXIO0_D1'}
- {pin_num: '95', pin_signal: PTD2/LLWU_P13/LPSPI0_SOUT/LPUART2_RX/TPM0_CH2/FXIO0_D2, label: 'J26[3]/J31[A78]/FXIO0_D2'}
- {pin_num: '96', pin_signal: PTD3/LPSPI0_SIN/LPUART2_TX/TPM0_CH3/FXIO0_D3, label: 'J26[4]/J31[A77]/FXIO0_D3'}
- {pin_num: '97', pin_signal: PTD4/LLWU_P14/LPSPI1_PCS0/LPUART2_RX/TPM0_CH4/LPUART0_RTS_b/FXIO0_D4, label: 'J26[5]/J31[A76]/FXIO0_D4'}
- {pin_num: '98', pin_signal: ADC0_SE6b/PTD5/LPSPI1_SCK/LPUART2_TX/TPM0_CH5/LPUART0_CTS_b/FXIO0_D5, label: 'J26[6]/J31[A75]/FXIO0_D5'}
- {pin_num: '99', pin_signal: ADC0_SE7b/PTD6/LLWU_P15/LPSPI1_SOUT/LPUART0_RX/FXIO0_D6, label: 'J26[7]/J31[A74]/FXIO0_D6'}
- {pin_num: '100', pin_signal: PTD7/LPSPI1_SIN/LPUART0_TX/FXIO0_D7, label: 'J26[8]/J31[A73]/FXIO0_D7'}
- {pin_num: '1', pin_signal: ADC0_SE16/PTE0/RTC_CLKOUT/LPSPI1_SIN/LPUART1_TX/CMP0_OUT/LPI2C1_SDA, label: 'J23[8]/J31[A35]/ADC0_SE16'}
- {pin_num: '2', pin_signal: ADC0_SE17/PTE1/LLWU_P0/LPSPI1_SOUT/LPUART1_RX/LPI2C1_SCL, label: 'J31[B45]/SPI1_SOUT'}
- {pin_num: '3', pin_signal: ADC0_SE18/PTE2/LLWU_P1/LPSPI1_SCK/LPUART1_CTS_b/LPI2C1_SDAS, label: 'J31[B48]/SPI1_SCK'}
- {pin_num: '4', pin_signal: ADC0_SE19/PTE3/LPSPI1_SIN/LPUART1_RTS_b/LPI2C1_SCLS, label: 'J31[B44]/SPI1_SIN'}
- {pin_num: '5', pin_signal: PTE4/LLWU_P2/LPSPI1_PCS0, label: 'J31[B46]/SPI1_PCS0'}
- {pin_num: '6', pin_signal: PTE5/LPSPI1_PCS1, label: 'J31[B47]/SPI1_PCS1'}
- {pin_num: '7', pin_signal: PTE6/LLWU_P16/LPSPI1_PCS2/I2S0_MCLK/USB_SOF_OUT, label: SW2, identifier: SW2}
- {pin_num: '10', pin_signal: USB0_DP, label: 'J29[3]/J31[A55]/KL28_USB0_DP/microUSB_DP', identifier: USB_DP}
- {pin_num: '11', pin_signal: USB0_DM, label: 'J29[2]/J31[A54]/KL28_USB0_DM/microUSB_DN', identifier: USB_DN}
- {pin_num: '12', pin_signal: VOUT33, label: 'J34[3]/VREGOUT_KL28', identifier: VREGOUT}
- {pin_num: '14', pin_signal: ADC0_DP1/ADC0_SE1/PTE16/LPSPI0_PCS0/LPUART2_TX/TPM0_CLKIN/LPSPI1_PCS3/FXIO0_D0, label: 'J25[18]/J31[A44]/UART2_TX'}
- {pin_num: '15', pin_signal: ADC0_DM1/ADC0_SE5a/PTE17/LLWU_P19/LPSPI0_SCK/LPUART2_RX/TPM1_CLKIN/LPTMR0_ALT3/LPTMR1_ALT3/FXIO0_D1, label: 'J25[17]/J31[A43]/UART2_RX'}
- {pin_num: '16', pin_signal: ADC0_DP2/ADC0_SE2/PTE18/LLWU_P20/LPSPI0_SOUT/LPUART2_CTS_b/LPI2C0_SDA/FXIO0_D2, label: 'J25[19]/J31[A9]/UART2_CTS_b'}
- {pin_num: '17', pin_signal: ADC0_DM2/ADC0_SE6a/PTE19/LPSPI0_SIN/LPUART2_RTS_b/LPI2C0_SCL/FXIO0_D3, label: 'J25[20]/J31[B21]/UART2_RTS_b'}
- {pin_num: '18', pin_signal: ADC0_DP0/ADC0_SE0/PTE20/LPSPI2_SCK/TPM1_CH0/LPUART0_TX/FXIO0_D4, label: 'J23[17]/J31[B27]/ADC0_DP0/ADC0_SE0'}
- {pin_num: '19', pin_signal: ADC0_DM0/ADC0_SE4a/PTE21/LPSPI2_SOUT/TPM1_CH1/LPUART0_RX/FXIO0_D5, label: 'J23[18]/J31[B28]/ADC0_DM0/ADC0_SE4a'}
- {pin_num: '20', pin_signal: ADC0_DP3/ADC0_SE3/PTE22/LPSPI2_SIN/TPM2_CH0/LPUART2_TX/FXIO0_D6, label: 'J24[17]/J31[B29]/ADC0_DP3/ADC0_SE3'}
- {pin_num: '21', pin_signal: ADC0_DM3/ADC0_SE7a/PTE23/LPSPI2_PCS0/TPM2_CH1/LPUART2_RX/FXIO0_D7, label: 'J24[18]/J31[B30]/ADC0_DM3/ADC0_SE7a'}
- {pin_num: '31', pin_signal: ADC0_SE20/PTE24/EMVSIM0_IO/TPM0_CH0/LPI2C0_SCL, label: 'J23[9]/J29[1]/U16[8]/ADC0_SE20/microUSB_VBUS', identifier: USB_DETECT}
- {pin_num: '32', pin_signal: ADC0_SE21/PTE25/LLWU_P21/EMVSIM0_PD/TPM0_CH1/LPI2C0_SDA, label: 'J23[12]/J29[4]/ADC0_SE21', identifier: USB_ID}
- {pin_num: '33', pin_signal: PTE26/RTC_CLKOUT/TPM0_CH5/LPI2C0_SCLS/USB_CLKIN, label: 'J6[2]/USB_CLKIN'}
- {pin_num: '26', pin_signal: CMP1_IN5/CMP0_IN5/ADC0_SE4b/PTE29/EMVSIM0_CLK/TPM0_CH2/TPM0_CLKIN, label: 'J21[1]/ADC0_SE4b/POT_5K', identifier: POT_5K}
- {pin_num: '27', pin_signal: DAC0_OUT/CMP1_IN3/ADC0_SE23/CMP0_IN4/PTE30/EMVSIM0_RST/TPM0_CH3/TPM1_CLKIN, label: 'J31[A34]/TPM0_CH3'}
- {pin_num: '28', pin_signal: PTE31/EMVSIM0_VCCEN/TPM0_CH4/TPM2_CLKIN/LPI2C0_HREQ, label: 'J31[A40]/TPM0_CH4'}
- {pin_num: '23', pin_signal: VREFH/VREF_OUT, label: 'J4[1]/J34[2]/J35[1]/MCU_PWR'}
- {pin_num: '24', pin_signal: VREFL, label: GND}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

